[
  {
    "id": 1,
    "title": "Active Directory",
    "img": "activedirectory.png",
    "desc": "As part of my project, I've created a home Active Directory lab to familiarize myself with its functionalities. Using VirtualBox software and virtual machines running Windows Server 2016 and Windows 10, I've built a comprehensive learning environment. Throughout the project, I've gained foundational knowledge in Active Directory configuration, DHCP configuration, account and group management, profiles, and group policies.",
    "more": "https://github.com/MikolajKnap/ActiveDirectoryHomeLab"
  },
  {
    "id": 2,
    "title": "Wireshark packet analysis ",
    "img": "wshark.png",
    "desc": "During this work I have analized different network traffic in Wireshark which includes for example telnet, ftp, tftp, voip, ospf passwords. I have used David Bombal youtube series dedicated to analizing network traffic using Wireshark in which He uploads pcap files to analize traffic yourself. After the project I have learned practical skills of how to analize network traffic and why security is key in modern networks.",
    "more": ""
  },
  {
    "id": 3,
    "title": "Vulnerability Management",
    "img": "nessus.png",
    "desc": "In my Vulnerability Management HomeLab project I've configured Nessus Essentials to conduct scans, both without and with credentials, uncovering vulnerabilities in a Windows 10 virtual machine I've crafted using VirtualBox. Throughout this practice, I've simulated outdated software on the VM and remediated vulnerabilities.",
    "more": "https://github.com/MikolajKnap/VulnerabilityManagementLab"
  },
  {
    "id": 4,
    "title": "RSA encryption",
    "img": "rsap.png",
    "desc": "This is my mini project in which I wanted to use python to implement the RSA encryption algorithm and use it to encrypt a file on my computer. The project helped me better understand how asymmetric keys work, how the RSA algorithm works, and practice programming in Python.",
    "more": "https://github.com/MikolajKnap/RSA_encryption_file"
  }
]